In [47]:
# Import Libaries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# Loading Datasets
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [48]:
df_original = df.copy()

df_original.sample(1)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
671605,Data Engineer,GIS Analyst,Abu Dhabi - United Arab Emirates,via Trabajo.org,Full-time,False,United Arab Emirates,2023-02-19 10:25:40,False,False,United Arab Emirates,None,NaN,NaN,Adecco Careers,"['word', 'excel', 'powerpoint']","{'analyst_tools': ['word', 'excel', 'powerpoin..."

In [49]:
df_company_salary = df_original.groupby('company_name')['salary_year_avg'].mean().reset_index()

In [50]:
df_company_remote = df_original[df_original['job_work_from_home']==True]

In [51]:
df_company_remote = df_company_remote.groupby('company_name')['job_title'].size().reset_index()

In [52]:
df_company_remote.rename(columns={'job_title': 'remote_count'},inplace=True)

In [53]:
df_company_remote

                                    company_name  remote_count
0                                    #EqualsTrue             4
1                                  #TeamGoHealth             1
2                        #twiceasnice Recruiting             1
3                                          &Work             1
4      (AEG) Application Engineering Group, Inc.             1
...                                          ...           ...
22983                                       知名外企             1
22984                                       精鼎医药             1
22985                     英屬維京群島商瑞嘉耐思科技有限公司台灣分公司             1
22986                                         雅虎             2
22987                                  𝐎𝐩𝐞𝐧𝐬𝐭𝐚𝐟𝐟             1

[22988 rows x 2 columns]

In [54]:
merged_df = pd.merge(df_company_salary,df_company_remote, on='company_name', how='inner')

In [55]:
merged_df.head(5)

                                company_name  salary_year_avg  remote_count
0                                #EqualsTrue              NaN             4
1                              #TeamGoHealth              NaN             1
2                    #twiceasnice Recruiting          77750.0             1
3                                      &Work              NaN             1
4  (AEG) Application Engineering Group, Inc.              NaN             1